# Pandas Missing Values, Datetime, Aggregation, and Merging

## Lecture Notes and in-class exercises

‚ñ∂Ô∏è First, run the code cell below to import `unittest`, a module used for **üß≠ Check Your Work** sections and the autograder.

In [1]:
import unittest
tc = unittest.TestCase()

#### üëá Tasks

- ‚úîÔ∏è Import the following Python packages.
    1. `pandas`: Use alias `pd`.
    2. `numpy`: Use alias `np`.

In [2]:
### BEGIN SOLUTION
import pandas as pd
import numpy as np
### END SOLUTION

#### üß≠ Check your work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [3]:
import sys
tc.assertTrue('pd' in globals(), 'Check whether you have correctly import Pandas with an alias.')
tc.assertTrue('np' in globals(), 'Check whether you have correctly import NumPy with an alias.')

### üìå Load employees data

‚ñ∂Ô∏è Run the code cell below to create a new `DataFrame` named `df_emp`.

In [4]:
# DO NOT CHANGE THE CODE IN THIS CELL
df_emp = pd.DataFrame({
    'emp_id': [30, 40, 10, 20],
    'name': ['Toby', 'Jim', 'Pam', 'Kelly'],
    'dept': ['HR', 'Sales', 'Sales', 'Customer Service'],
    'office_phone': ['(217)123-4500', np.nan, np.nan, '(217)987-6600'],
    'start_date': ['2017-05-01', '2018-02-01', '2020-08-01', '2019-12-01'],
    'salary': [202000, 185000, 240000, 160500]
})

# Used for intermediate checks
df_emp_backup = df_emp.copy()

df_emp

   emp_id   name              dept   office_phone  start_date  salary
0      30   Toby                HR  (217)123-4500  2017-05-01  202000
1      40    Jim             Sales            NaN  2018-02-01  185000
2      10    Pam             Sales            NaN  2020-08-01  240000
3      20  Kelly  Customer Service  (217)987-6600  2019-12-01  160500

---

### üìå Concise summary of a `DataFrame`

‚ñ∂Ô∏è Run `df_emp.info()` below to see a concise summary of the `DataFrame`.

In [5]:
### BEGIN SOLUTION
df_emp.info()
### END SOLUTION

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   emp_id        4 non-null      int64
 1   name          4 non-null      object
 2   dept          4 non-null      object
 3   office_phone  2 non-null      object
 4   start_date    4 non-null      object
 5   salary        4 non-null      int64
dtypes: int64(2), object(4)
memory usage: 320.0+ bytes

---

## üëâ Selecting Subset Columns

You can select a subset of columns from a `DataFrame` using `df[list_of_columns]`.

You can also use `df.loc[:, list_of_columns]`.

```python
df[["col1", "col2"]]

# is equivalent to

df.loc[:, ["col1", "col2"]]
```

---

### üéØ Challenge 1: `emp_id` and `name`

#### üëá Tasks

- ‚úîÔ∏è Select only `emp_id` and `name` columns from `df_emp` (in the same order).
- ‚úîÔ∏è Store the result to a new variable named `df_id_name`.
- ‚úîÔ∏è Your `df_emp` should remain unaltered.

#### üöÄ Hints

Use the following code as a reference.

```python
df_subset = df[["col1", "col2"]]
```

‚ñ∂Ô∏è Run the code cell below to reset your `df_emp`.

In [6]:
df_emp = df_emp_backup.copy()
df_emp

   emp_id   name              dept   office_phone  start_date  salary
0      30   Toby                HR  (217)123-4500  2017-05-01  202000
1      40    Jim             Sales            NaN  2018-02-01  185000
2      10    Pam             Sales            NaN  2020-08-01  240000
3      20  Kelly  Customer Service  (217)987-6600  2019-12-01  160500

In [7]:
### BEGIN SOLUTION
df_id_name = df_emp[["emp_id", "name"]]
### END SOLUTION

df_id_name

   emp_id   name
0      30   Toby
1      40    Jim
2      10    Pam
3      20  Kelly

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [8]:
# Challenge 1 Autograder
pd.testing.assert_frame_equal(df_emp, df_emp_backup)
pd.testing.assert_frame_equal(df_emp_backup[["emp_id", "name"]], df_id_name, check_like=True)

---

### üéØ Challenge 2: `emp_id`, `name`, `dept`, `salary`

#### üëá Tasks

- ‚úîÔ∏è Select `emp_id`, `name`, `dept`, and `salary` columns from `df_emp` (in the same order).
- ‚úîÔ∏è Store the result to a new variable named `df_subset`.
- ‚úîÔ∏è Your `df_emp` should remain unaltered.

#### üöÄ Hints

Use the following code as a reference.

```python
df_subset = df[["col1", "col2"]]
```

‚ñ∂Ô∏è Run the code cell below to reset your `df_emp`.

In [9]:
df_emp = df_emp_backup.copy()
df_emp

   emp_id   name              dept   office_phone  start_date  salary
0      30   Toby                HR  (217)123-4500  2017-05-01  202000
1      40    Jim             Sales            NaN  2018-02-01  185000
2      10    Pam             Sales            NaN  2020-08-01  240000
3      20  Kelly  Customer Service  (217)987-6600  2019-12-01  160500

In [10]:
### BEGIN SOLUTION
df_subset = df_emp[["emp_id", "name", "dept", "salary"]]
### END SOLUTION

df_subset

   emp_id   name              dept  salary
0      30   Toby                HR  202000
1      40    Jim             Sales  185000
2      10    Pam             Sales  240000
3      20  Kelly  Customer Service  160500

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [11]:
# Challenge 2 Autograder
pd.testing.assert_frame_equal(df_emp, df_emp_backup)
pd.testing.assert_frame_equal(df_emp_backup[["emp_id", "name", "dept", "salary"]], df_subset)

---

## üëâ Working with Missing Values

A dataset commonly can contain one or more missing values. Pandas provides a flexible set of methods for you to work with missing values. Our first discussion of missing values will demonstrate how to find missing values.

Missing values can be denoted by multiple *markers*. Here are a few common markers.

- `NaN`: NaN stands for "not a number". For simplicity and performance's sake, Pandas has traditionally used `NaN` to denote missing values.
- `None` (python's built-in type)
- `NA`
- `NaT`

---

### üìå Load data

‚ñ∂Ô∏è Run the code cell below to create a new `DataFrame` named `df_you`.

In [12]:
# DO NOT CHANGE THE CODE IN THIS CELL
df_you = pd.read_csv("https://github.com/bdi475/datasets/raw/main/about-you.csv")

# Used to keep a clean copy
df_you_backup = df_you.copy()

# head() displays the first 5 rows of a DataFrame
df_you.head()

,name,major1,major2,city,country,fav_restaurant,fav_movie,has_iphone
0,Dane Jacobsen,Agr & Consumer Economics,Business,Chicago,USA,Sushi Man,The Iron Claw,True
1,Bingqing Li,Statistics,Econometrics & Quant Econ,Shanghai,China,Yogi,Frozen,True
2,Kam Chiu Chong,Economics,Information Systems,Hong Kong,NaN,NaN,NaN,True
3,Jiaqi Zeng,Mathematics,Computer Science,Zhuhai,China,Northern Cuisine,Interstellar,True
4,Rishi Shah,Information Sciences + DS,Business,Chicago,USA,Taco Bell,Forrest Gump,True

The table below describes each column in `df_you`.

| Column Name             | Description                                               |
|-------------------------|-----------------------------------------------------------|
| name                    | First name                                                |
| major1                  | Major                                                     |
| major2                  | Second major OR minor (blank if no second major or minor) |
| city                    | City the person is from                                   |
| fav_restaurant          | Favorite restaurant (blank if no restaurant was given)    |
| has_iphone              | Whether the person use an iPhone                          |

---

### üéØ Challenge 3: People from Schaumburg

#### üëá Tasks

- ‚úîÔ∏è Using `df_you`, filter rows where the person is from `"Schaumburg"`.
    - Check whether the `city` column is equal to `"Schaumburg"`.
    - Store the result to a new variable named `df_schaumburg`.
- ‚úîÔ∏è `df_you` should remain unaltered after your code.

In [13]:
### BEGIN SOLUTION
df_schaumburg = df_you[df_you["city"] == "Schaumburg"]
### END SOLUTION

df_schaumburg

Empty DataFrame
Columns: [name, major1, major2, city, country, fav_restaurant, fav_movie, has_iphone]
Index: []

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [14]:
# Challenge 3 Autograder
# df_you should remain unaltered
pd.testing.assert_frame_equal(df_you, df_you_backup)

pd.testing.assert_frame_equal(df_schaumburg.sort_values(df_schaumburg.columns.tolist()).reset_index(drop=True),
                              df_you_backup.query(f'{"cItY".lower()} == "{"ScHauMBurg".capitalize()}"')
                                 .sort_values(df_you_backup.columns.tolist()).reset_index(drop=True))

---

### üéØ Challenge 4: Anyone with a non-missing `major2`

#### üëá Tasks

- ‚úîÔ∏è Using `df_you`, filter rows where the person has a second major or a minor.
    - You're looking for rows where the `major2` column is not `NaN`.
- ‚úîÔ∏è `NaN` is a special value to denote missing value. You must use `my_series.isna()` or `my_series.notna()` to check whether a row contains a missing value or not.
- ‚úîÔ∏è Store the result to a new variable named `df_major2`.
- ‚úîÔ∏è `df_you` should remain unaltered after your code.

#### üöÄ Hints

- `my_series.notna()` can be used to check whether a row contains a missing value or not.

![notna](https://github.com/bdi475/images/blob/main/pandas/notna-series.png?raw=true)

In [15]:
### BEGIN SOLUTION
df_major2 = df_you[df_you["major2"].notna()]
### END SOLUTION

df_major2

,name,major1,major2,city,country,fav_restaurant,fav_movie,has_iphone
0,Dane Jacobsen,Agr & Consumer Economics,Business,Chicago,USA,Sushi Man,The Iron Claw,True
1,Bingqing Li,Statistics,Econometrics & Quant Econ,Shanghai,China,Yogi,Frozen,True
2,Kam Chiu Chong,Economics,Information Systems,Hong Kong,NaN,NaN,NaN,True
3,Jiaqi Zeng,Mathematics,Computer Science,Zhuhai,China,Northern Cuisine,Interstellar,True
4,Rishi Shah,Information Sciences + DS,Business,Chicago,USA,Taco Bell,Forrest Gump,True
...,...,...,...,...,...,...,...,...
110,Christine Ruan,Advertising,Informatics,Chicago,USA,Spoon House,Inside Out 2,True
112,Alia Afeef,Information Sciences,Business,Chicago,USA,Himalayan Chimney,True Romance,True
113,Ava Castle,Advertising,Business,Elgin,USA,Biaggi's,The Devil Wears Prada,True
116,Connor Gordon,Aerospace Engineering,Business,Sussex,USA,Papa Del's,Interstellar,True
117,Dhruv Nambisan,Industrial Engineering,Business,Chicago,USA,Fernandos Tacos,Django Unchained,True

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [16]:
# Challenge 4 Autograder
# df_you should remain unaltered
pd.testing.assert_frame_equal(df_you, df_you_backup)

pd.testing.assert_frame_equal(df_major2.sort_values(df_major2.columns.tolist()).reset_index(drop=True),
                              df_you_backup.query(f"major2 == major2")
                                 .sort_values(df_you_backup.columns.tolist()).reset_index(drop=True))

---

### üéØ Challenge 5: Anyone without a favorite restaurant

#### üëá Tasks

- ‚úîÔ∏è Using `df_you`, filter rows where the person's `fav_restaurant` is `NaN`.
- ‚úîÔ∏è `NaN` is a special value to denote missing value. You must use `my_series.isna()` or `my_series.notna()` to compare a `Series` with `NaN`.
- ‚úîÔ∏è Store the result to a new variable named `df_no_fav_restaurant`.
- ‚úîÔ∏è `df_you` should remain unaltered after your code.

#### üöÄ Hints

- `my_series.isna()` can be used to check whether a row contains a missing value.

In [17]:
### BEGIN SOLUTION
df_no_fav_restaurant = df_you[df_you["fav_restaurant"].isna()]
### END SOLUTION

df_no_fav_restaurant

,name,major1,major2,city,country,fav_restaurant,fav_movie,has_iphone
2,Kam Chiu Chong,Economics,Information Systems,Hong Kong,NaN,NaN,NaN,True
5,Beni Lawson,Architecture,Informatics,Aurora,USA,NaN,NaN,True
10,Colin Hegener,Agr & Consumer Economics,Business,Chicago,USA,NaN,The Social Network,True
15,Gerardo Ortiz,Computer Science,Business,Chicago,USA,NaN,The Bee Movie,True
17,Megha Agrawal,Bioengineering,NaN,NaN,NaN,NaN,NaN,True
24,Mingyue Zhang,Advertising,NaN,NaN,NaN,NaN,NaN,True
32,Wendy Zheng,Statistics,NaN,NaN,NaN,NaN,NaN,True
36,Martha Abrahamson,Chemical Engineering,NaN,NaN,NaN,NaN,NaN,True
40,Tina Ding,Sociology,NaN,Shanghai,China,NaN,NaN,True
49,Xuan Shih,Accountancy,Informatics,NaN,Taiwan,NaN,Minions,True
64,Yijia Ella Li,Economics,Business,NaN,China,NaN,NaN,True
65,Adrian Rodriguez,Community Health,Health Technology,Chicago,USA,NaN,Goodfellas,True
74,Kaitai Zhao,NaN,NaN,NaN,NaN,NaN,NaN,True
77,Vinayak Bagdi,Statistics,NaN,NaN,NaN,NaN,NaN,True
89,Xing Zhao,Computer Science,Business,Zhengzhou,China,NaN,Spiderman,True
90,Gus Suksathien,Computer Science,Business,Bangkok,Thailand,NaN,Transformers,True
92,Varun Nair Rajeev,Engineering Physics,Business,Kerala,India,NaN,The Martian,True
98,Faaz Arif,Mechanical Engineering,NaN,NaN,NaN,NaN,NaN,True
104,Anushka Kansal,Computer Science,NaN,NaN,NaN,NaN,NaN,True
111,Angela Tian,Statistics,NaN,NaN,NaN,NaN,NaN,True
114,Renee Crawley,Interdisciplinary Health,NaN,NaN,NaN,NaN,NaN,True

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [18]:
# Challenge 5 Autograder
# df_you should remain unaltered
pd.testing.assert_frame_equal(df_you, df_you_backup)

pd.testing.assert_frame_equal(df_no_fav_restaurant.sort_values(df_no_fav_restaurant.columns.tolist()).reset_index(drop=True),
                              df_you_backup.query(f"fav_restaurant != fav_restaurant")
                                 .sort_values(df_you_backup.columns.tolist()).reset_index(drop=True))

---

## üóìÔ∏è Working with Datetime Values

You will often see date-looking strings in your data. A few examples are:

- `20210315`
- `Mar 15, 2021`
- `2020-03-15`
- `2020/3/15`

In this part of today's lecture, we'll discuss how we can *parse* and utilize datetime values.

---

**Question**: What is the data type of the `start_date` column?

‚ñ∂Ô∏è Run `str(df_emp['start_date'].dtype)` below to see the data type of the `start_date` column.

In [19]:
### BEGIN SOLUTION
str(df_emp['start_date'].dtype)
### END SOLUTION

'object'

While `object` can refer to many different types, you can safely assume that all `object` data types you see in this course refer to strings.

---

### üéØ Challenge 6: Parse a string column as datetime

#### üëá Tasks

- ‚úîÔ∏è Using `df_emp`, Parse `start_date` to a `datetime` data type.
- ‚úîÔ∏è Store the result to a new column named `start_date_parsed`.

#### üöÄ Hints

The code below converts `date_str` column to a `datetime`-typed column and stores the converted result to a new column named `date_parsed`.

```python
my_dataframe['date_parsed'] = pd.to_datetime(my_dataframe['date_str'])
```

In [20]:
### BEGIN SOLUTION
df_emp['start_date_parsed'] = pd.to_datetime(df_emp['start_date'])
### END SOLUTION

df_emp

,emp_id,name,dept,office_phone,start_date,salary,start_date_parsed
0,30,Toby,HR,(217)123-4500,2017-05-01,202000,2017-05-01
1,40,Jim,Sales,NaN,2018-02-01,185000,2018-02-01
2,10,Pam,Sales,NaN,2020-08-01,240000,2020-08-01
3,20,Kelly,Customer Service,(217)987-6600,2019-12-01,160500,2019-12-01

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [21]:
# Challenge 6 Autograder
tc.assertEqual(set(df_emp.columns), set(df_emp_backup.columns.tolist() + ['start_date_parsed']))
pd.testing.assert_series_equal(df_emp['start_date_parsed'].reset_index(drop=True),
                               pd.to_datetime(df_emp_backup['_'.join(['sTarT', 'DaTe']).lower()])
                                  .reset_index(drop=True),
                               check_names=False)

---

‚ñ∂Ô∏è Run `str(df_emp['start_date_parsed'].dtype)` below to see the data type of the `start_date` column.

In [22]:
# BEGIN SOLUTION
str(df_emp['start_date_parsed'].dtype)
### END SOLUTION

'datetime64[ns]'

---

### üéØ Challenge 7: Drop `start_date` column *in-place*

We no longer need the `start_date` column. We'll work with the new `start_date_parsed` column from this point on.

#### üëá Tasks

- ‚úîÔ∏è Drop `start_date` column from `df_emp` *in-place*.

#### üöÄ Hints

The code below drops `col1` from `my_dataframe` *in-place* without creating a new variable.

```python
my_dataframe.drop(columns=['col1'], inplace=True)
```

In [23]:
### BEGIN SOLUTION
df_emp.drop(columns=['start_date'], inplace=True)
### END SOLUTION

df_emp

   emp_id   name              dept   office_phone  salary start_date_parsed
0      30   Toby                HR  (217)123-4500  202000        2017-05-01
1      40    Jim             Sales            NaN  185000        2018-02-01
2      10    Pam             Sales            NaN  240000        2020-08-01
3      20  Kelly  Customer Service  (217)987-6600  160500        2019-12-01

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [24]:
# Challenge 7 Autograder
df_check = df_emp_backup.copy()
df_check['_'.join(['sTarT', 'DaTe', 'pArSeD']).lower()] = pd.to_datetime(df_check['start_date'])
df_check = df_check.drop(columns=['start_date'])

# Check result
tc.assertEqual(set(df_emp.columns), set(['start_date_parsed', 'salary', 'office_phone', 'dept', 'name', 'emp_id']))
pd.testing.assert_frame_equal(df_emp.sort_values(df_emp.columns.tolist()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Challenge 8: Rename `start_date_parsed` to `start_date`

#### üëá Tasks

- ‚úîÔ∏è Rename `start_date_parsed` to `start_date` in `df_emp` *in-place*.

#### üöÄ Hints

The code below renames the `name_before` column to `name_after` in `my_dataframe` *in-place* without creating a new variable.

```python
my_dataframe.rename(columns={'name_before': 'name_after'}, inplace=True)
```

In [25]:
### BEGIN SOLUTION
df_emp.rename(columns={'start_date_parsed': 'start_date'}, inplace=True)
### END SOLUTION

df_emp

   emp_id   name              dept   office_phone  salary start_date
0      30   Toby                HR  (217)123-4500  202000 2017-05-01
1      40    Jim             Sales            NaN  185000 2018-02-01
2      10    Pam             Sales            NaN  240000 2020-08-01
3      20  Kelly  Customer Service  (217)987-6600  160500 2019-12-01

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [26]:
# Challenge 8 Autograder
df_check = df_emp_backup.copy()
df_check['_'.join(['sTarT', 'DaTe', 'pArSeD']).lower()] = pd.to_datetime(df_check['start_date'])
df_check = df_check.drop(columns=['start_date']).rename(columns={'start_date_parsed': 'start_date'})

# Check result
pd.testing.assert_frame_equal(df_emp.sort_values(df_emp.columns.tolist()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Challenge 9: Extract year from a datetime column

#### üëá Tasks

- ‚úîÔ∏è Create a new column named `start_year` in `df_emp` that contains the starting years in integers (e.g., `2017`, `2018`).
- ‚úîÔ∏è Extract values from `df_emp['start_date']`.

#### üöÄ Hints

The code extracts the year of a datetime column `my_date` and stores it to a new column named `my_year`.

```python
my_dataframe['my_year'] = my_dataframe['my_date'].dt.year
```

In [27]:
### BEGIN SOLUTION
df_emp['start_year'] = df_emp['start_date'].dt.year
### END SOLUTION

df_emp

,emp_id,name,dept,office_phone,salary,start_date,start_year
0,30,Toby,HR,(217)123-4500,202000,2017-05-01,2017
1,40,Jim,Sales,NaN,185000,2018-02-01,2018
2,10,Pam,Sales,NaN,240000,2020-08-01,2020
3,20,Kelly,Customer Service,(217)987-6600,160500,2019-12-01,2019

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [28]:
# Challenge 9 Autograder
df_check = df_emp_backup.copy()
df_check['_'.join(['sTarT', 'DaTe', 'pArSeD']).lower()] = pd.to_datetime(df_check['start_date'])
df_check = df_check.drop(columns=['start_date']).rename(columns={'start_date_parsed': 'start_date'})
df_check['_'.join(['sTarT', 'yEaR']).lower()] = df_check['_'.join(['sTarT', 'dAtE']).lower()].dt.year

# Check result
pd.testing.assert_frame_equal(df_emp.sort_values(df_emp.columns.tolist()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

### üéØ Challenge 10: Extract month, day from a datetime column

#### üëá Tasks

- ‚úîÔ∏è Create new columns named `start_month` and `start_day` in `df_emp` that contain the starting months and days in integers.
- ‚úîÔ∏è Extract values from `df_emp['start_date']`.

#### üöÄ Hints

The code extracts the months and days of a datetime column `my_date` and stores it to two new columns.

```python
my_dataframe['my_month'] = my_dataframe['my_date'].dt.month
my_dataframe['my_day'] = my_dataframe['my_date'].dt.day
```

In [29]:
### BEGIN SOLUTION
df_emp['start_month'] = df_emp['start_date'].dt.month
df_emp['start_day'] = df_emp['start_date'].dt.day
### END SOLUTION

df_emp

,emp_id,name,dept,office_phone,salary,start_date,start_year,start_month,start_day
0,30,Toby,HR,(217)123-4500,202000,2017-05-01,2017,5,1
1,40,Jim,Sales,NaN,185000,2018-02-01,2018,2,1
2,10,Pam,Sales,NaN,240000,2020-08-01,2020,8,1
3,20,Kelly,Customer Service,(217)987-6600,160500,2019-12-01,2019,12,1

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [30]:
# Challenge 10 Autograder
df_check = df_emp_backup.copy()
df_check['_'.join(['sTarT', 'DaTe', 'pArSeD']).lower()] = pd.to_datetime(df_check['start_date'])
df_check = df_check.drop(columns=['start_date']).rename(columns={'start_date_parsed': 'start_date'})
df_check['_'.join(['sTarT', 'yEaR']).lower()] = df_check['_'.join(['sTarT', 'dAtE']).lower()].dt.year
df_check['_'.join(['sTarT', 'mOnTh']).lower()] = df_check['_'.join(['sTarT', 'dAtE']).lower()].dt.month
df_check['_'.join(['sTarT', 'dAy']).lower()] = df_check['_'.join(['sTarT', 'dAtE']).lower()].dt.day

# Check result
pd.testing.assert_frame_equal(df_emp.sort_values(df_emp.columns.tolist()).reset_index(drop=True),
                              df_check.sort_values(df_check.columns.tolist()).reset_index(drop=True))

---

‚ñ∂Ô∏è Run `df_emp['start_date'].dt.weekday` below.

In [31]:
### BEGIN SOLUTION
df_emp['start_date'].dt.weekday
### END SOLUTION

0    0
1    3
2    5
3    6
Name: start_date, dtype: int32

Note that Monday is 0 and Sunday returns 6.

---

‚ñ∂Ô∏è Run `df_emp['start_date'].dt.quarter` below.

In [32]:
### BEGIN SOLUTION
df_emp['start_date'].dt.quarter
### END SOLUTION

0    2
1    1
2    3
3    4
Name: start_date, dtype: int32

This returns the quarter of a year (e.g., Q1, Q2, Q3, Q4).

---

## üî¨ Grouping and Aggregating Data with Pandas

üëâ A very common task in working with data is to *summarize* your data by one or more criteria. As an example, you may want to find out the average salary of employees **by department**. Pandas allows you to use a [*split-apply-combine*](https://pandas.pydata.org/pandas-docs/stable/user_guide/groupby.html) pattern to perform those types of tasks.

---

### üìå Create employees data

‚ñ∂Ô∏è Run the code cell below to create a new `DataFrame` named `df`.

In [33]:
df = pd.DataFrame({
    'name': ['Mary', 'Roy', 'John', 'Joe', 'Paul', 'Erin'],
    'dept': ['Finance', 'Purchase', 'Finance', 'Purchase', 'Finance', 'Purchase'],
    'salary': [240000, 160000, 250000, 170000, 260000, 180000]}
)

df

   name      dept  salary
0  Mary   Finance  240000
1   Roy  Purchase  160000
2  John   Finance  250000
3   Joe  Purchase  170000
4  Paul   Finance  260000
5  Erin  Purchase  180000

---

### üìå Creating a `DataFrameGroupBy` object

‚ñ∂Ô∏è Run `df.groupby('dept')` below.

In [34]:
### BEGIN SOLUTION
df.groupby('dept')
### END SOLUTION

#### Notes

- Internally, Pandas will create one group per department when you run `.groupby('dept')`.
- However, you will be able to see the groups until we apply aggregation function(s) to each group.
- The strange-looking output (in the form of `<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000012345678910>`) tells us that the result is a `DataFrameGroupBy` object.
- The diagram below describes what Pandas is doing behind the scene.

![groupby object](https://github.com/bdi475/images/blob/main/pandas/df-groupby-object-01.png?raw=true)

---

### üìå Aggregating a `DataFrameGroupBy` object

‚ñ∂Ô∏è Run `df.groupby('dept').agg({'salary': 'mean'})` below.

In [35]:
### BEGIN SOLUTION
df.groupby('dept').agg({'salary': 'mean'})
### END SOLUTION

            salary
dept
Finance   250000.0
Purchase  170000.0

üëâ Your resulting `DataFrame` now displays average salary by `dept`.

#### Columns used as "pivots"

```python
df_salary_by_dept = df.groupby('dept').agg({'salary': 'mean'})

display(df_salary_by_dept)
print(df_salary_by_dept.columns)
```

‚ñ∂Ô∏è Copy the provided code above to the code cell below and run it.

In [36]:
### BEGIN SOLUTION
df_salary_by_dept = df.groupby('dept').agg({'salary': 'mean'})

display(df_salary_by_dept)
print(df_salary_by_dept.columns)
### END SOLUTION

            salary
dept
Finance   250000.0
Purchase  170000.0

Index(['salary'], dtype='object')

üëâ There is only one column shown when you print out `df_salary_by_dept.columns`! üôÄ

This is because the column(s) you use to create groups are used as **index** by default.

![groupby agg result](https://github.com/bdi475/images/blob/main/pandas/df-groupby-agg-as-index-true-01.png?raw=true)

---

### üìå Aggregating a `DataFrameGroupBy` object with optional `index=False`

```python
df_salary_by_dept2 = df.groupby('dept', as_index=False).agg({'salary': 'mean'})

display(df_salary_by_dept2)
print(df_salary_by_dept2.columns)
```

‚ñ∂Ô∏è Copy the provided code to the code cell below and run it.

In [37]:
### BEGIN SOLUTION
df_salary_by_dept2 = df.groupby('dept', as_index=False).agg({'salary': 'mean'})

display(df_salary_by_dept2)
print(df_salary_by_dept2.columns)
### END SOLUTION

       dept    salary
0   Finance  250000.0
1  Purchase  170000.0

Index(['dept', 'salary'], dtype='object')

üëâ Now, printing out the columns show both `dept` and `salary`. Supplying `as_index=False` to `groupby()` keeps the columns you use as the "pivot" as regular columns.

![groupby agg result](https://github.com/bdi475/images/blob/main/pandas/df-groupby-agg-as-index-false-01.png?raw=true)

---

### üìå Creating multiple aggregation measures

```python
df_salary_by_dept3 = df.groupby('dept', as_index=False).agg({'salary': ['min', 'max', 'mean', 'sum', 'count', 'std']})

display(df_salary_by_dept3)
print(df_salary_by_dept3.columns)
```

‚ñ∂Ô∏è Copy the provided code to the code cell below and run it.

In [38]:
### BEGIN SOLUTION
df_salary_by_dept3 = df.groupby('dept', as_index=False).agg({'salary': ['min', 'max', 'mean', 'sum', 'count', 'std']})

display(df_salary_by_dept3)
print(df_salary_by_dept3.columns)
### END SOLUTION

       dept  salary
                min     max      mean     sum count      std
0   Finance  240000  260000  250000.0  750000     3  10000.0
1  Purchase  160000  180000  170000.0  510000     3  10000.0

MultiIndex([(  'dept',      ''),
            ('salary',   'min'),
            ('salary',   'max'),
            ('salary',  'mean'),
            ('salary',   'sum'),
            ('salary', 'count'),
            ('salary',   'std')],
           )

---

### üìå Flattening multi-level index columns

When you apply two or more aggregation functions to a column, your DataFrame creates a hierarchically structured columns. It is often easier to work with a DataFrame if you have a flat-level columns. You can manually assign the column names after `.agg()` in these cases to *flatten* the columns.

```python
df_salary_by_dept4 = df.groupby('dept', as_index=False).agg({'salary': ['min', 'max', 'mean', 'sum', 'count', 'std']})

display(df_salary_by_dept4)
print('Columns before (multi-level, not flat):')
print(df_salary_by_dept4.columns)

# manually assign column names
df_salary_by_dept4.columns = ['dept', 'min_salary', 'max_salary', 'mean_salary', 'total_salary', 'num_employees', 'std_dev']

display(df_salary_by_dept4)
print('Columns after (flat-level):')
print(df_salary_by_dept4.columns)
```

‚ñ∂Ô∏è Copy the provided code to the code cell below and run it.

In [39]:
# YOUR CODE BEGINS
df_salary_by_dept4 = df.groupby('dept', as_index=False).agg({'salary': ['min', 'max', 'mean', 'sum', 'count', 'std']})

display(df_salary_by_dept4)
print('Columns before (multi-level, not flat):')
print(df_salary_by_dept4.columns)

# manually assign column names
df_salary_by_dept4.columns = ['dept', 'min_salary', 'max_salary', 'mean_salary', 'total_salary', 'num_employees', 'std_dev']

display(df_salary_by_dept4)
print('Columns after (flat-level):')
print(df_salary_by_dept4.columns)
# YOUR CODE ENDS

       dept  salary
                min     max      mean     sum count      std
0   Finance  240000  260000  250000.0  750000     3  10000.0
1  Purchase  160000  180000  170000.0  510000     3  10000.0

Columns before (multi-level, not flat):
MultiIndex([(  'dept',      ''),
            ('salary',   'min'),
            ('salary',   'max'),
            ('salary',  'mean'),
            ('salary',   'sum'),
            ('salary', 'count'),
            ('salary',   'std')],
           )

,dept,min_salary,max_salary,mean_salary,total_salary,num_employees,std_dev
0,Finance,240000,260000,250000.0,750000,3,10000.0
1,Purchase,160000,180000,170000.0,510000,3,10000.0

Columns after (flat-level):
Index(['dept', 'min_salary', 'max_salary', 'mean_salary', 'total_salary',
       'num_employees', 'std_dev'],
      dtype='object')

---

## üìû Exercises Using Bank Marketing Calls Data

For the next part of this lecture, you'll work with a dataset related with direct marketing campaigns (phone calls) of a banking institution. 

**Data Source**: [Moro et al., 2014] S. Moro, P. Cortez and P. Rita. A Data-Driven Approach to Predict the Success of Bank Telemarketing. Decision Support Systems, Elsevier, 62:22-31, June 2014

| Column Name     | Type        | Description                                                                                                                                                     |
|-----------------|-------------|-----------------------------------------------------------------------------------------------------------------------------------------------------------------|
| `age`           | Numeric     | Age                                                                                                                                                             |
| `job`           | Categorical | admin.', 'blue-collar',   'entrepreneur', 'housemaid', 'management', 'retired', 'self-employed',   'services', 'student', 'technician', 'unemployed', 'unknown' |
| `marital`       | Categorical | single', 'married', 'divorced', 'unknown'                                                                                                                       |
| `education`     | Categorical | basic.4y', 'basic.6y', 'basic.9y', 'high.school', 'illiterate',   'professional.course', 'university.degree', 'unknown'                                         |
| `contact_type`  | Categorical | cellular', 'telephone'                                                                                                                                          |
| `num_contacts`  | Numeric     | Number of contacts performed during this campaign for this client                                                                                               |
| `prev_outcome`  | Categorical | Outcome of the previous marketing campaign - 'failure', 'nonexistent',   'success'                                                                              |
| `place_deposit` | Numeric     | Did the client subscribe to a term deposit? This column indicates whether the campaign was successful (1) or not (0) for each client.                                        |

---


Your goal is to analyze the dataset to discover relationships between personal factors and marketing campaign result of each individual.

**`place_deposit`** column indicates whether a marketing campaign was successful.
z
- ‚úÖ If `1`, the individual has placed a deposit within the bank. This is considered a **successful campaign**.
- üö´ If `0`, the individual has not placed a deposit within the bank. This is considered an **unsuccessful campaign**.

---

### üìå Load data

‚ñ∂Ô∏è Run the code cell below to create a new `DataFrame` named `df_m`.

In [40]:
df_m = pd.read_csv('https://github.com/bdi475/datasets/blob/main/bank-direct-marketing.csv?raw=true')
df_m_backup = df_m.copy()
df_m

,age,job,marital,education,contact_type,num_contacts,prev_outcome,place_deposit
0,56,housemaid,married,basic.4y,telephone,1,nonexistent,False
1,57,services,married,high.school,telephone,1,nonexistent,False
2,37,services,married,high.school,telephone,1,nonexistent,False
3,40,admin.,married,basic.6y,telephone,1,nonexistent,False
4,56,services,married,high.school,telephone,1,nonexistent,False
...,...,...,...,...,...,...,...,...
41183,73,retired,married,professional.course,cellular,1,nonexistent,True
41184,46,blue-collar,married,professional.course,cellular,1,nonexistent,False
41185,56,retired,married,university.degree,cellular,2,nonexistent,False
41186,44,technician,married,professional.course,cellular,1,nonexistent,True
41187,74,retired,married,professional.course,cellular,3,failure,False

---

### üéØ Challenge 11: Marketing success rate by marital status

#### üëá Tasks

- ‚úîÔ∏è Using `df_m`, create an aggregated table named `df_by_marital` that lists the success rate (average of the `place_deposit` column) by marital status.
- ‚úîÔ∏è Use the `as_index=False` option.
- ‚úîÔ∏è The aggregated DataFrame should have two columns - "marital" and "success_rate".
- ‚úîÔ∏è `df_by_marital` should only have the following two columns in the same order.
    - `marital`: Marital status (e.g., single, divorced, married, unknown)
    - `success_rate`: Average success rate (between 0-1)
- ‚úîÔ∏è Both columns should not be used as an index column.
    - Printing `df_by_marital.columns.to_list()` should print out `['marital', 'success_rate']`.
- ‚úîÔ∏è Sort `df_by_marital` by `success_rate` in descending order *in-place*.

#### üîë Expected Output

|    | marital   |   success_rate |
|---:|:----------|---------------:|
|  3 | unknown   |       0.15     |
|  2 | single    |       0.140041 |
|  0 | divorced  |       0.103209 |
|  1 | married   |       0.101573 |

In [41]:
### BEGIN SOLUTION
df_by_marital = df_m.groupby('marital', as_index=False).agg({'place_deposit': 'mean'})
df_by_marital.rename(columns={'place_deposit': 'success_rate'}, inplace=True)
df_by_marital.sort_values('success_rate', ascending=False, inplace=True)
### END SOLUTION

df_by_marital

    marital  success_rate
3   unknown      0.150000
2    single      0.140041
0  divorced      0.103209
1   married      0.101573

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [42]:
# Challenge 11 Autograder
df_check = df_m_backup.groupby('marital', as_index=bool(0)).agg({'place_deposit': 'mean'}) \
    .rename(columns={'_'.join(['place', 'deposit']): 'success_rate'}) \
    .sort_values('success_rate').iloc[::-1]
df_check = df_check[['success_rate', 'marital'][::-1]].copy()

# Check result
pd.testing.assert_frame_equal(df_by_marital.reset_index(drop=True),
                              df_check.reset_index(drop=True))

---

### üéØ Challenge 12: Marketing success rate by job

#### üëá Tasks

- ‚úîÔ∏è Using `df_m`, create an aggregated table named `df_by_job` to that lists the average success rate in direct marketing campaigns by job.
- ‚úîÔ∏è Use the `as_index=False` option.
- ‚úîÔ∏è `df_by_job` should only have the following two columns in the same order.
    - `job`: Job (e.g., student, technician, housemaid, etc)
    - `success_rate`: Average success rate (between 0-1)
- ‚úîÔ∏è Both columns should not be used as an index column.
    - Printing `df_by_job.columns.to_list()` should print out `['job', 'success_rate']`.
- ‚úîÔ∏è Sort `df_by_job` by `success_rate` in descending order.

#### üîë Expected Output

|    | job           |   success_rate |
|---:|:--------------|---------------:|
|  8 | student       |      0.314286  |
|  5 | retired       |      0.252326  |
| 10 | unemployed    |      0.142012  |
|  0 | admin.        |      0.129726  |
|  4 | management    |      0.112175  |
| 11 | unknown       |      0.112121  |
|  9 | technician    |      0.10826   |
|  6 | self-employed |      0.104856  |
|  3 | housemaid     |      0.1       |
|  2 | entrepreneur  |      0.0851648 |
|  7 | services      |      0.0813807 |
|  1 | blue-collar   |      0.0689432 |

In [43]:
### BEGIN SOLUTION
df_by_job = df_m.groupby('job', as_index=False).agg({'place_deposit': 'mean'})
df_by_job.rename(columns={'place_deposit': 'success_rate'}, inplace=True)
df_by_job.sort_values('success_rate', ascending=False, inplace=True)
### END SOLUTION

df_by_job

              job  success_rate
8         student      0.314286
5         retired      0.252326
10     unemployed      0.142012
0          admin.      0.129726
4      management      0.112175
11        unknown      0.112121
9      technician      0.108260
6   self-employed      0.104856
3       housemaid      0.100000
2    entrepreneur      0.085165
7        services      0.081381
1     blue-collar      0.068943

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [44]:
# Challenge 12 Autograder
df_check = df_m_backup.groupby('job').agg({'place_deposit': 'mean'}).reset_index() \
    .rename(columns={'_'.join(['place', 'deposit']): 'success_rate'}) \
    .sort_values('success_rate').iloc[::-1]
df_check = df_check[['success_rate', 'job'][::-1]].copy()

pd.testing.assert_frame_equal(df_by_job.reset_index(drop=True),
                              df_check.reset_index(drop=True))

---

### üéØ Challenge 13: Marketing success rate by contact type with count

#### üëá Tasks

- ‚úîÔ∏è Using `df_m`, create an aggregated table named `df_by_contact_type` that lists the number of campaigns and the average success rate by contact type.
- ‚úîÔ∏è Use the `as_index=False` option.
- ‚úîÔ∏è `df_by_contact_type` should only have the following three columns in the same order.
    - `contact_type`: Contact method (e.g., cellular, telephone)
    - `count`: Number of potential customers that were contacted using the corresponding contact type
    - `success_rate`: Average success rate (between 0-1)
- ‚úîÔ∏è All three columns should not be used as an index column.
    - Printing `df_by_contact_type.columns.to_list()` should print out `['contact_type', 'count', 'success_rate']`.
- ‚úîÔ∏è Sort `df_by_contact_type` by `success_rate` in descending order.

#### üîë Expected Output

|    | contact_type   |   count |   success_rate |
|---:|:---------------|--------:|---------------:|
|  0 | cellular       |   26144 |      0.147376  |
|  1 | telephone      |   15044 |      0.0523132 |

In [45]:
### BEGIN SOLUTION
df_by_contact_type = df_m.groupby('contact_type', as_index=False).agg({
    'place_deposit': ['count', 'mean']
})

# flatten columns
df_by_contact_type.columns = ['contact_type', 'count', 'success_rate']

df_by_contact_type.sort_values('success_rate', ascending=False, inplace=True)
### END SOLUTION
df_by_contact_type

  contact_type  count  success_rate
0     cellular  26144      0.147376
1    telephone  15044      0.052313

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [46]:
# Challenge 13 Autograder
df_check = df_m_backup.groupby('_'.join(['contact', 'type'])).agg({'place_deposit': ['count', 'mean']}).reset_index()
df_check.columns = ['SUCCESS_RATE'.lower(), 'COUNT'.lower(), 'CONTACT_TYPE'.lower()][::-1]
df_check = df_check \
    .sort_values('success_rate').iloc[::-1]

pd.testing.assert_frame_equal(df_by_contact_type.reset_index(drop=True),
                              df_check.reset_index(drop=True))

---

### üìå Grouping by multiple columns

You can run a `groupby()` with two or more columns by supplying a `list` of columns to the `groupby()` function.

```python
# example
df.groupby(['column1', 'column2'], as_index=False).agg({ 'column3': ... })
```

---

### üéØ Challenge 14: Marketing success rate by marital status and contact type

#### üëá Tasks

- ‚úîÔ∏è Using `df_m`, create an aggregated table named `df_by_type_and_marital` that lists the average success rate in direct marketing campaigns by marital status and contact type.
- ‚úîÔ∏è Use the `as_index=False` option.
- ‚úîÔ∏è `df_by_type_and_marital` should only have the following three columns in the same order.
    - `marital`: Marital status (e.g., single, divorced, married, unknown)
    - `contact_type`: Contact method (e.g., cellular, telephone)
    - `success_rate`: Average success rate (between 0-1)
- ‚úîÔ∏è All three columns should not be used as an index column.
    - Printing `df_by_type_and_marital.columns.to_list()` should print out `['marital', 'contact_type', 'success_rate']`.
- ‚úîÔ∏è Sort `df_by_type_and_marital` by `success_rate` in descending order.

#### üîë Expected Output

|    | marital   | contact_type   |   success_rate |
|---:|:----------|:---------------|---------------:|
|  6 | unknown   | cellular       |      0.207547  |
|  4 | single    | cellular       |      0.173875  |
|  0 | divorced  | cellular       |      0.13652   |
|  2 | married   | cellular       |      0.135341  |
|  5 | single    | telephone      |      0.0648844 |
|  3 | married   | telephone      |      0.0487554 |
|  1 | divorced  | telephone      |      0.0463615 |
|  7 | unknown   | telephone      |      0.037037  |

In [47]:
### BEGIN SOLUTION
df_by_type_and_marital = df_m.groupby(['marital', 'contact_type'], as_index=False).agg({
    'place_deposit': 'mean'
})
df_by_type_and_marital.rename(columns={'place_deposit': 'success_rate'}, inplace=True)
df_by_type_and_marital.sort_values('success_rate', ascending=False, inplace=True)
### END SOLUTION

df_by_type_and_marital

    marital contact_type  success_rate
6   unknown     cellular      0.207547
4    single     cellular      0.173875
0  divorced     cellular      0.136520
2   married     cellular      0.135341
5    single    telephone      0.064884
3   married    telephone      0.048755
1  divorced    telephone      0.046362
7   unknown    telephone      0.037037

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [48]:
# Challenge 14 Autograder
df_check = df_m_backup.groupby(['MARITAL'.lower(), '_'.join(['contact', 'type'])]) \
    .agg({'place_deposit': 'mean'}).reset_index()
df_check.rename(columns={'place_deposit': '_'.join(['SUCCESS', 'RATE']).lower()}, inplace=bool(1))
df_check = df_check \
    .sort_values('success_rate').iloc[::-1]

pd.testing.assert_frame_equal(df_by_type_and_marital.reset_index(drop=True),
                              df_check.reset_index(drop=True))

---

## üß≤ Merging two DataFrames (Joins)

Another common operation with tables is to merge two or more tables into one larger table.

To demonstrate how merging works, we'll work a record of transactions from a small food stand selling only two items - sweetcorns üåΩ and beers üç∫. The tables associated with the food stand's transactions are shown below.

### Products (`df_products`)

| product_id | product_name | price |
|---|---|---|
| SC | Sweetcorn | 3.0 |
| CB | Beer | 5.0 |

### Transactions (`df_transactions`)

| transaction_id | product_id |
|---|---|
| 1 | SC |
| 2 | SC |
| 3 | CB |
| 4 | SC |
| 5 | SC |
| 6 | SC |
| 7 | CB |
| 8 | SC |
| 9 | CB |
| 10 | SC |

‚ñ∂Ô∏è Run the code below to create the two tables as DataFrames.

In [49]:
# DO NOT CHANGE THE CODE BELOW
df_products = pd.DataFrame({
    'product_id': ['SC', 'CB'],
    'product_name': ['Sweetcorn', 'Beer'],
    'price': [3.0, 5.0]
})

df_transactions = pd.DataFrame({
    'transaction_id': [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    'product_id': ['SC', 'SC', 'CB', 'SC', 'SC', 'SC', 'CB', 'SC', 'CB', 'SC']
})

df_products_backup = df_products.copy()
df_transactions_backup = df_transactions.copy()

display(df_products)
display(df_transactions)

  product_id product_name  price
0         SC    Sweetcorn    3.0
1         CB         Beer    5.0

   transaction_id product_id
0               1         SC
1               2         SC
2               3         CB
3               4         SC
4               5         SC
5               6         SC
6               7         CB
7               8         SC
8               9         CB
9              10         SC

---

### üéØ Challenge 15: Merge products into transactions

#### üëá Tasks

- ‚úîÔ∏è Using `df_products` and `df_transactions`, create a merged table as shown below.
- ‚úîÔ∏è Use a left merge.
- ‚úîÔ∏è Name the merged DataFrame `df_merged`.

#### üöÄ Hints

The code below merges `right_dataframe` into `left_dataframe` using `shared_key_column`. The resulting type of the merge is a left-merge.

```python
merged_dataframe = pd.merge(
    left=left_dataframe,
    right=right_dataframe,
    on='shared_key_column',
    how='left'
)
```

#### üß≠ Expected Output of `df_merged`

|  | transaction_id | product_id | product_name | price |
|---|---|---|---|---|
| 0 | 1 | SC | Sweetcorn | 3.0 |
| 1 | 2 | SC | Sweetcorn | 3.0 |
| 2 | 3 | CB | Beer | 5.0 |
| 3 | 4 | SC | Sweetcorn | 3.0 |
| 4 | 5 | SC | Sweetcorn | 3.0 |
| 5 | 6 | SC | Sweetcorn | 3.0 |
| 6 | 7 | CB | Beer | 5.0 |
| 7 | 8 | SC | Sweetcorn | 3.0 |
| 8 | 9 | CB | Beer | 5.0 |
| 9 | 10 | SC | Sweetcorn | 3.0 |

In [50]:
### BEGIN SOLUTION
df_merged = pd.merge(
    left=df_transactions,
    right=df_products,
    on='product_id',
    how='left'
)
### END SOLUTION

display(df_merged)

   transaction_id product_id product_name  price
0               1         SC    Sweetcorn    3.0
1               2         SC    Sweetcorn    3.0
2               3         CB         Beer    5.0
3               4         SC    Sweetcorn    3.0
4               5         SC    Sweetcorn    3.0
5               6         SC    Sweetcorn    3.0
6               7         CB         Beer    5.0
7               8         SC    Sweetcorn    3.0
8               9         CB         Beer    5.0
9              10         SC    Sweetcorn    3.0

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [51]:
# Challenge 15 Autograder
df_merged_SOL = df_transactions_backup.merge(
    df_products_backup,
    on= '_'.join(['product', 'id']),
    how='inner'
).sort_values('_'.join(['transaction', 'id']))

pd.testing.assert_frame_equal(df_merged.reset_index(drop=True),
                              df_merged_SOL.reset_index(drop=True))

---

### üéØ Challenge 16: Total sales by product

#### üëá Tasks

- ‚úîÔ∏è Using `df_merged` from the previous exercise, find the total sales by product.
- ‚úîÔ∏è Store the grouped result (a DataFrame) to `df_sales_by_product`.
- ‚úîÔ∏è Use the `groupby()` method on the `product_id` column.
- ‚úîÔ∏è `df_sales_by_product` should contain flat-level columns.
    - Printing `df_sales_by_product.columns.to_list()` should print out `['product_id', 'price']`.

#### üß≠ Expected Output of `df_sales_by_product`

|  | product_id | price |
|---|---|---|
| 0 | CB | 15.0 |
| 1 | SC | 21.0 |

In [52]:
### BEGIN SOLUTION
df_sales_by_product = df_merged.groupby('product_id', as_index=False).agg({ 'price': 'sum' })
### END SOLUTION

display(df_sales_by_product)

  product_id  price
0         CB   15.0
1         SC   21.0

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [53]:
# Challenge 16 Autograder
df_merged_SOL = df_transactions_backup.merge(
    df_products_backup,
    on='product_id',
    how='left'
)
df_sales_by_product_SOL = df_merged_SOL.groupby('PRODUCT_ID'.lower()).agg({'price': np.sum}).reset_index()

pd.testing.assert_frame_equal(df_sales_by_product, df_sales_by_product_SOL)

/tmp/ipykernel_3341821/3702352193.py:7: FutureWarning: The provided callable <function sum at 0x7fcc5c320280> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df_sales_by_product_SOL = df_merged_SOL.groupby('PRODUCT_ID'.lower()).agg({'price': np.sum}).reset_index()

---

### üéØ Challenge of the day: Total sales by product (OPTIONAL)

‚ö†Ô∏è This challenge is a chance to showcase your problem-solving abilities. The code examples used in the lecture may not be sufficient to perform this task.

#### üëá Tasks

- ‚úîÔ∏è Using `df_merged` from the previous exercise, find the total sales by product.
- ‚úîÔ∏è Store the grouped result (a DataFrame) to `df_sales_by_id_name`.
    - This time, include the `product_name` information in addition to the `product_id` column.
- ‚úîÔ∏è Use the `groupby()` method.
- ‚úîÔ∏è `df_sales_by_id_name` should contain flat-level columns in the order shown below.
    - Printing `df_sales_by_id_name.columns.to_list()` should print out `['product_id', 'product_name', 'price']`.

#### üß≠ Expected Output of `df_sales_by_id_name`

|  | product_id | product_name | price |
|---|---|---|---|
| 0 | CB | Beer | 15 |
| 1 | SC | Sweetcorn | 21 |

In [54]:
### BEGIN SOLUTION
df_sales_by_id_name = df_merged.groupby(['product_id', 'product_name'], as_index=False).agg({'price': 'sum'})
### END SOLUTION

display(df_sales_by_id_name)

  product_id product_name  price
0         CB         Beer   15.0
1         SC    Sweetcorn   21.0

#### üß≠ Check Your Work

- Once you're done, run the code cell below to test correctness.
- ‚úîÔ∏è If the code cell runs without an error, you're good to move on.
- ‚ùå If the code cell throws an error, go back and fix incorrect parts.

In [55]:
# Challenge 17 Autograder (OPTIONAL)
# DO NOT CHANGE THE CODE BELOW
df_merged_SOL = df_transactions_backup.merge(
    df_products_backup,
    on='product_id',
    how='left'
)

df_sales_by_id_name_SOL = df_merged_SOL.groupby(['product_id', 'product_name'], as_index=False).agg({'price': 'sum'})


pd.testing.assert_frame_equal(df_sales_by_id_name, df_sales_by_id_name_SOL)